//Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// int SomeDigital(int num)
// {
//     int some = num %10;
//     return some;
// }

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());

// int dig = SomeDigital(number);

// Console.WriteLine($"третье число в {number} это {dig}");