//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
Console.Clear();
Console.Write("Введите число: ");
string number = Console.ReadLine();
string str = number.ToString();
Console.WriteLine(str[2]);











